Tests/StressTest/50000VU_per_S/UseCaseB.yml
config:
  plugins:
  target: "https://kwqnze338k.us-east-1.awsapprunner.com"
  phases:
    - duration: 30
      arrivalRate: 50
      name: Warm up
    - duration: 60
      arrivalRate: 50
      rampTo: 1000
      name: 1. Ramp Up
    - duration: 60
      arrivalRate: 1000
      rampTo: 10000
      name: 2. Ramp Up
    - duration: 60
      arrivalRate: 10000
      rampTo: 25000
      name: 3. Ramp Up
    - duration: 60
      arrivalRate: 25000
      rampTo: 50000
      name: 4. Ramp Up
    - duration: 120
      arrivalRate: 50000
      name: Hold

scenarios:
  - name: "Choose one recipe"
    flow:
      - get:
          url: "/recipes"
      - think: 2
      - get:
          url: "/recipes/2"
      - think: 1